import numpy as np
import pandas as pd
from datetime import datetime

dates = ['4/25/2023','4/26/2023','4/27/2023','4/28/2023','4/29/2023','4/30/2023']

dates = pd.to_datetime(dates)
print(dates)
print(type(dates)) #<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

print("====================================================")
ts = pd.Series([2, np.nan, np.nan, 8, 10, np.nan],index=dates) #series = vactor와 같은느낌., series가 모이면 Dataframe
print(ts)

print("====================================================")

ts = ts.interpolate()
print(ts)

print("====================================================")

######################출력값############################
# ====================================================
# 2023-04-25     2.0
# 2023-04-26     NaN
# 2023-04-27     NaN
# 2023-04-28     8.0
# 2023-04-29    10.0
# 2023-04-30     NaN
# dtype: float64
# ====================================================

# 2023-04-25     2.0
# 2023-04-26     4.0
# 2023-04-27     6.0
# 2023-04-28     8.0
# 2023-04-29    10.0
# 2023-04-30    10.0 -> 마지막값이 10이어서 10으로 예상.
